const API_MAIN = 'https://api.2ip.ua/';

export const API = {
  GEO: (ip: string = '') => `${API_MAIN}geo.json?ip=${ip}`,
  PROVIDER: (ip: string = '') => `${API_MAIN}provider.json?ip=${ip}`,
};

export const GEO_FIELDS = [
  {id: 'ip', name: 'Проверяемый IP адрес'},
  {id: 'country_rus', name: 'Страна'},
  {id: 'region_rus', name: 'Регион'},
  {id: 'city_rus', name: 'Город'},
  {id: 'latitude', name: 'Широта'},
  {id: 'longitude', name: 'Долгота'},
  {id: 'zip_code', name: 'Почтовый индекс'},
  {id: 'time_zone', name: 'Часовой пояс'}
];

export const PROVIDER_FIELDS = [
  {id: 'ip', name: 'Проверяемый IP адрес'},
  {id: 'name_ripe', name: 'Официальное название провайдера в IRR'},
  {id: 'name_rus', name: 'Название провайдера'},
  {id: 'site', name: 'Сайт'},
  {id: 'as', name: 'Номер автономной системы провайдера'},
  {id: 'ip_range_start', name: 'Первый IP адрес сети'},
  {id: 'ip_range_end', name: 'Последний IP адрес сети'},
  {id: 'route', name: 'Сеть провайдера'},
  {id: 'mask', name: 'Маска сети'}
];

export const IPV4_PATTERN = /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/;

export const IPV4_IPV6_PATTERN = /((^\s*((([0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])\.){3}([0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5]))\s*$)|(^\s*((([0-9A-Fa-f]{1,4}:){7}([0-9A-Fa-f]{1,4}|:))|(([0-9A-Fa-f]{1,4}:){6}(:[0-9A-Fa-f]{1,4}|((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3})|:))|(([0-9A-Fa-f]{1,4}:){5}(((:[0-9A-Fa-f]{1,4}){1,2})|:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3})|:))|(([0-9A-Fa-f]{1,4}:){4}(((:[0-9A-Fa-f]{1,4}){1,3})|((:[0-9A-Fa-f]{1,4})?:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){3}(((:[0-9A-Fa-f]{1,4}){1,4})|((:[0-9A-Fa-f]{1,4}){0,2}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){2}(((:[0-9A-Fa-f]{1,4}){1,5})|((:[0-9A-Fa-f]{1,4}){0,3}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(([0-9A-Fa-f]{1,4}:){1}(((:[0-9A-Fa-f]{1,4}){1,6})|((:[0-9A-Fa-f]{1,4}){0,4}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:))|(:(((:[0-9A-Fa-f]{1,4}){1,7})|((:[0-9A-Fa-f]{1,4}){0,5}:((25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)(\.(25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)){3}))|:)))(%.+)?\s*$))/;